app/controllers/students_controller.rb

SELECT "students".* FROM "students"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index
    @students = Student.all
    @student = Student.find